[
  {
    "slug": "/",
    "title": "Sync, Export & Import",
    "description": "",
    "content": ""
  },
  {
    "slug": "/sync-export-import/export-cards",
    "title": "Export cards to Excel/CSV",
    "description": "",
    "content": "In GoCards, you can export your deck in two ways:\n\n1. From the card list: Open the menu in the top-right corner and select \"Export cards\".\n2. From the deck list: Open the menu on a deck, click \"More,\" and then select \"Export cards\" from the bottom menu.\n\n<center>\n  <img src=\"/images/docs/cards-list-menu.png\" width=\"300\" />\n</center>\n"
  },
  {
    "slug": "/sync-export-import/import-cards",
    "title": "Import cards to Excel/CSV",
    "description": "In GoCards, you can import decks from the deck list by clicking the three-dot menu in the top-right corner.",
    "content": "Your file should contain three columns: Term, Definition, and Disabled (optional).\r\nAny additional columns will be ignored.\n"
  },
  {
    "slug": "/sync-export-import",
    "title": "Sync, Export & Import",
    "description": "",
    "content": "## Documents\n"
  },
  {
    "slug": "/sync-export-import/sync-cards",
    "title": "Synchronize CSV and Excel Files with Your Android Flashcards App",
    "description": "Do you create your flashcards on your phone or laptop? I prefer using a larger screen, as it's more convenient for creating and organizing cards. However, I always review my flashcards on my smartphone since it's portable and accessible anywhere.",
    "content": "<iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/rthjtSAq13A?si=ipRAJYeRNYG1ermM\" title=\"YouTube video player\" frameBorder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerPolicy=\"strict-origin-when-cross-origin\" allowFullScreen />\n\n## Supported files\n\nGoCards supports synchronization with Excel (.xlsx, .xls) and CSV (.csv) files, making it easy to manage flashcards across different formats.\n\n## What Can a Syncing Flashcard Algorithm Do?\n\nA syncing algorithm ensures that flashcards remain up to date between a file and the GoCards application.\r\nIt determines how to add, update, or remove flashcards based on which source has the most recent changes.\n\nUnlike other flashcard applications that require users to remove and re-import decks—causing the loss of all study progress\r\n— **GoCards is the only app that can synchronize flashcards while preserving study progress!**\n\nThe file has a modification date, and every flashcard in GoCards has a last updated date recorded when the card is modified.\n\n**If the File is Newer Than the Flashcard in GoCards:**\n\n1. **Adding New Cards**: Any new cards found in the file that do not exist in GoCards are added to the synced deck.\n2. **Deleting Removed Cards**: If a card has been deleted from the file, it will be removed from the GoCards deck.\n3. **Updating Existing Cards**: If a card has been modified in the file, it will be updated in the GoCards deck.\r\n   The update occurs only if there is at least a 70% similarity in the term or definition between the file and the card in GoCards.\n4. **Preserving Card Order**: The deck will be reordered to match the newer sequence.\n5. **Preserving Study Progress**: Study progress will be retained for updated and unchanged cards.\n\n**If the Flashcard in the Synced Deck is Newer Than the File:** \\\nSimilar rules apply as above, but flashcards in the file are adjusted to match those in the synced deck. \\\nAdditionally:\n\n1. **Maintaining Additional Columns**: When changing the card order, any extra columns in the file not used by GoCards will be moved together with the corresponding card to the correct row.\n\n## Check Which Cards Have Been Synced in the Card List\n\nWhen you go to the \"List Cards\" activity, the right sidebar will indicate which cards have been modified during the last sync.\n\n* Orange: The card has been updated.\n* Green: The card is new.\n\nColor Intensity:\n\n* More intense colors indicate changes from the file.\n* Less intense colors indicate changes from the app.\n"
  }
]